{
  "_class_name": "LongCatVideoAvatarTransformer3DModel",
  "architectures": [
    "LongCatVideoAvatarTransformer3DModel"
  ],
  "_diffusers_version": "0.32.0",
  "in_channels": 16,
  "out_channels": 16,
  "hidden_size": 4096,
  "depth": 48,
  "num_heads": 32,
  "caption_channels": 4096,
  "model_max_length": 512,
  "mlp_ratio": 4,
  "adaln_tembed_dim": 512,
  "frequency_embedding_size": 256,
  "patch_size": [
    1,
    2,
    2
  ],
  "enable_flashattn3": false,
  "enable_flashattn2": true,
  "enable_xformers": false,
  "enable_bsa": false,
  "bsa_params": null,
  "cp_split_hw": null,
  "text_tokens_zero_pad": true,
  "audio_window": 5,
  "audio_block": 5,
  "audio_channel": 1280,
  "intermediate_dim": 512,
  "output_dim": 768,
  "context_tokens": 32,
  "vae_scale": 4,
  "audio_prenorm": false,
  "class_range": 24,
  "class_interval": 4
}