{
  "metadata": {
    "total_size": 31705833600
  },
  "weight_map": {
    "x_embedder.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "x_embedder.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "t_embedder.mlp.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "t_embedder.mlp.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "t_embedder.mlp.2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "t_embedder.mlp.2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "y_embedder.y_proj.0.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "y_embedder.y_proj.0.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "y_embedder.y_proj.2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "y_embedder.y_proj.2.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.0.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.1.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.2.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.3.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.4.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.5.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.ffn.w1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.ffn.w2.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.6.ffn.w3.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.qkv.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.qkv.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.cross_attn.k_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00001-of-00006.safetensors",
    "blocks.7.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.7.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.7.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.7.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.7.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.7.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.8.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.9.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.10.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.11.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.12.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.13.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.audio_cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.ffn.w1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.ffn.w2.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.14.ffn.w3.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.audio_adaLN_modulation.1.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.audio_adaLN_modulation.1.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.pre_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.pre_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.pre_video_crs_attn_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.pre_video_crs_attn_norm.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.qkv.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.qkv.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.q_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.q_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.kv_linear.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.kv_linear.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.proj.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.proj.bias": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.q_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
    "blocks.15.cross_attn.k_norm.weight": "diffusion_pytorch_model-00002-of-00006.safetensors",
