{
  "metadata": {
    "total_size": 6173962240
  },
  "weight_map": {
    "model.decoder.embed_positions.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.embed_tokens.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.0.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.1.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.10.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.11.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.12.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.13.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.14.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.15.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.16.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.17.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.18.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.19.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.fc2.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.fc2.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.final_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.final_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.2.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.encoder_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.fc1.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.fc1.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.20.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.20.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.20.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.k_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.out_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.out_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.q_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.q_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.v_proj.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn.v_proj.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn_layer_norm.bias": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.20.self_attn_layer_norm.weight": "model.fp32-00001-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.21.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.22.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.23.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.24.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.25.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.26.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.27.self_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.q_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.q_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.v_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn.v_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.encoder_attn_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.fc1.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.fc1.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.fc2.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.fc2.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.final_layer_norm.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.final_layer_norm.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.self_attn.k_proj.weight": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.self_attn.out_proj.bias": "model.fp32-00002-of-00002.safetensors",
    "model.decoder.layers.28.self_attn.out_proj.weight": "model.fp32-00002-of-00002.safetensors",
